const uk = {
  translation: {
    language: 'Мова',
    changePassword: 'Змінити пароль',
    logout: 'Вийти',
    settings: 'Налаштування',
    showMouse: 'Показати мишу',
    hideMouse: 'Сховати мишу',
    power: 'Живлення',
    reset: 'Скидання',
    powerShort: 'Живлення (коротке натискання)',
    powerLong: 'Живлення (довге натискання)',
    hddLed: 'Індикатор HDD',
    checkLibFailed: 'Не вдалося перевірити бібліотеку виконання, спробуйте ще раз',
    updateLibFailed: 'Не вдалося оновити бібліотеку виконання, спробуйте ще раз',
    updatingLib: 'Оновлення бібліотеки виконано. Оновіть сторінку після оновлення.',
    checkForUpdate: 'Перевірити оновлення',
    head: {
      desktop: 'Віддалений робочий стіл',
      login: 'Вхід',
      changePassword: 'Змінити пароль',
      terminal: 'Термінал'
    },
    auth: {
      login: 'Вхід',
      placeholderUsername: 'Введіть ім\'я користувача',
      placeholderPassword: 'введіть пароль',
      placeholderPassword2: 'введіть пароль ще раз',
      noEmptyUsername: 'ім\'я користувача не може бути порожнім',
      noEmptyPassword: 'пароль не може бути порожнім',
      noAccount: 'Не вдалося отримати інформацію про користувача, оновіть веб-сторінку або скиньте пароль',
      invalidUser: 'недійсне ім\'я користувача або пароль',
      error: 'якась халепа! непередбачена помилка :(',
      changePassword: 'Змінити пароль',
      differentPassword: 'паролі не збігаються',
      illegalUsername: 'ім\'я користувача містить недопустимі символи',
      illegalPassword: 'пароль містить недопустимі символи',
      forgetPassword: 'Забули пароль',
      resetPassword: 'Скинути пароль',
      reset1: 'Якщо ви забули пароль, виконайте наступні кроки для його скидання:',
      reset2: '1. Увійдіть на пристрій NanoKVM через SSH;',
      reset3: '2. Видаліть файл на пристрої: ',
      reset4: '3. Використовуйте обліковий запис за замовчуванням для входу: ',
      ok: 'Ок',
      cancel: 'Скасувати'
    },
    screen: {
      resolution: 'Роздільна здатність',
      auto: 'Автоматично',
      autoTips: 'Може виникнути розрив зображення або зміщення миші при певних роздільних здатностях. Розгляньте можливість налаштування роздільної здатності віддаленого хоста або вимкнення автоматичного режиму для передачі відеопотоку.',
      fps: 'Кадри в секунду',
      customizeFps: 'Налаштувати',
      quality: 'Якість',
      frameDetect: 'Виявлення кадрів',
      frameDetectTip:
      	"Обчислює різницю між кадрами. Зупиняє передачу відеопотоку, коли на екрані віддаленого хоста не виявлено змін."
    },
    keyboard: {
      paste: 'Вставити',
      tips: 'Підтримуються лише стандартні літери та символи клавіатури',
      placeholder: 'Будь ласка, введіть',
      submit: 'Надіслати',
      virtual: 'Клавіатура'
    },
    mouse: {
      default: 'Курсор за замовчуванням',
      pointer: 'Курсор-стрілка',
      cell: 'Курсор-таблиця',
      text: 'Курсор-текст',
      grab: 'Курсор-захоплення',
      hide: 'Сховати курсор',
      mode: 'Режим миші',
      absolute: 'Абсолютний режим',
      relative: 'Відносний режим',
      requestPointer: 'Використовується відносний режим. Будь ласка, натисніть на робочий стіл, щоб отримати курсор миші.',
      resetHid: 'Скинути HID'
    },
    image: {
      title: 'Зображення',
      loading: 'Завантаження...',
      empty: 'Нічого не знайдено',
      mountFailed: 'Не вдалося змонтувати',
      mountDesc:
          "У деяких системах необхідно витягнути віртуальний диск на віддаленому хості перед монтуванням файлу образа.",
      tips: {
        title: 'Як завантажити',
        usb1: 'Під\'єднайте NanoKVM до вашого комп\'ютера через USB.',
        usb2: 'Переконайтеся, що віртуальний диск змонтовано (Налаштування - Віртуальний диск).',
        usb3: 'Відкрийте віртуальний диск на вашому комп\'ютері та скопіюйте файл зображення до кореневого каталогу віртуального диска.',
        scp1: 'Переконайтеся, що NanoKVM і ваш комп\'ютер знаходяться в одній локальній мережі.',
        scp2: 'Відкрийте термінал на вашому комп\'ютері та використовуйте команду SCP для завантаження файлу зображення до каталогу /data на NanoKVM.',
        scp3: 'Приклад: scp ваш-шлях-до-зображення root@ваш-ip-nanokvm:/data',
        tfCard: 'TF карта',
        tf1: 'Цей метод підтримується на системах Linux',
        tf2: 'Отримайте TF карту з NanoKVM (для повної версії, спочатку розберіть корпус).',
        tf3: 'Вставте TF карту в кардрідер і під\'єднайте її до вашого комп\'ютера.',
        tf4: 'Скопіюйте файл зображення до каталогу /data на TF карті.',
        tf5: 'Вставте TF карту в NanoKVM.'
      }
    },
    script: {
      title: 'Скрипт',
      upload: 'Завантажити',
      run: 'Запустити',
      runBackground: 'Запустити у фоновому режимі',
      runFailed: 'Не вдалося запустити',
      attention: 'Увага',
      delDesc: 'Ви впевнені, що хочете видалити цей файл?',
      confirm: 'Так',
      cancel: 'Ні',
      delete: 'Видалити',
      close: 'Закрити'
    },
    terminal: {
      title: 'Термінал',
      nanokvm: 'Термінал NanoKVM',
      serial: 'Термінал послідовного порту',
      serialPort: 'Послідовний порт',
      serialPortPlaceholder: 'Будь ласка, введіть послідовний порт',
      baudrate: 'Швидкість передачі',
      confirm: 'Ок'
    },
    wol: {
      sending: 'Посилання команди...',
      sent: 'Команду відправлено',
      input: 'Будь ласка, введіть MAC',
      ok: 'Ок'
    },
    about: {
      title: 'Про NanoKVM',
      information: 'Інформація',
      ip: 'IP',
      mdns: 'mDNS',
      application: 'Версія додатку',
      image: 'Версія образу',
      deviceKey: 'Ключ пристрою',
      queryFailed: 'Запит не вдався',
      community: 'Спільнота'
    },
    update: {
      title: 'Перевірити оновлення',
      queryFailed: 'Не вдалося отримати версію',
      updateFailed: 'Оновлення не вдалося. Будь ласка, спробуйте ще раз.',
      isLatest: 'У вас вже остання версія.',
      available: 'Доступне оновлення. Ви впевнені, що хочете оновити?',
      updating: 'Оновлення розпочато. Будь ласка, зачекайте...',
      confirm: 'Підтвердити',
      cancel: 'Скасувати'
    },
    virtualDevice: {
      network: 'Віртуальна мережа',
      disk: 'Віртуальний диск'
    },
    tailscale: {
      loading: 'Завантаження...',
      notInstall: 'Tailscale не знайдено! Будь ласка, встановіть клієнт Tailscale.',
      install: 'Встановити',
      installing: 'Встановлення',
      failed: 'Не вдалося встановити',
      retry: 'Будь ласка, оновіть сторінку та спробуйте ще раз. Або спробуйте встановити вручну',
		download: 'Завантажте',
		package: 'пакет встановлення',
		unzip: 'та розпакуйте його',
		upTailscale: 'Завантажте tailscale до каталогу /usr/bin/ на NanoKVM',
		upTailscaled: 'Завантажте tailscaled до каталогу /usr/sbin/ на NanoKVM',
		refresh: 'Оновіть поточну сторінку',
		notLogin:
            'Пристрій ще не прив\'язаний. Будь ласка, увійдіть і прив\'яжіть цей пристрій до вашого облікового запису.',
		urlPeriod: 'Ця URL-адреса дійсна протягом 10 хвилин',
		login: 'Увійти',
		loginSuccess: 'Успішний вхід',
		enable: 'Увімкнути Tailscale',
		deviceName: 'Назва пристрою',
		deviceIP: 'IP пристрою',
		account: 'Обліковий запис',
		logout: 'Вийти',
		logout2: 'Ви впевнені, що хочете вийти?'
	  }
	}
};

export default uk;
